Config/Documents/НачислениеРезервовПоСомнительнымДолгам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеРезервовПоСомнительнымДолгам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеДоходыИРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасчетов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолгаНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокЗадержки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/УдалитьЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УдалитьЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/НачислениеРезервовПоСомнительнымДолгам/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
Процедура ОсновныеДействияФормыНастройка(Кнопка)

	//ОбщегоНазначения.РучнаяКорректировкаОсновнаяФорма(ЭтоНовый(),Ссылка,ЭтотОбъект);

КонецПроцедуры // ДействияФормыДвиженияДокументаПоРегистрам()

Функция РазностьДатВДнях(Дата1, Дата2)
	мДлинаСуток = 86400; // в секундах
	Возврат Окр((НачалоДня(Дата1) - НачалоДня(Дата2)) / мДлинаСуток);
КонецФункции

Процедура КоманднаяПанельОчистить(Кнопка)
	//ТабЧасть.Очистить();
	//ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
КонецПроцедуры

Функция ВыручкаЗаПериод()
	
	НачалоПериода = Объект.НачалоПериода;
	КонецПериода = Объект.КонецПериода;
	ТабЧасть = Объект.ТабЧасть;
	Организация = Объект.Организация;
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД);
	Запрос.УстановитьПараметр("КорСчет",ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
	
	Запрос.Текст = "ВЫБРАТЬ
				   |	ХозрасчетныйОбороты.СуммаОборотКт КАК ВыручкаВсего
				   |ИЗ
				   |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , , , , , ) КАК ХозрасчетныйОбороты
				   |ГДЕ
				   |	ХозрасчетныйОбороты.Организация = &Организация
				   |	И ХозрасчетныйОбороты.Счет      = &Счет
				   |	И ХозрасчетныйОбороты.КорСчет   = &КорСчет";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
			ВыручкаВсего = Выборка.ВыручкаВсего;
	Иначе ВыручкаВсего=1;		
	КонецЕсли;
	
	Возврат ВыручкаВсего;	
КонецФункции

Функция ВыборкаЗадолженностиКонтрагентов()
	
	ЮрФизЛицо = Объект.ЮрФизЛицо;
	НачалоПериода = НачалоДня(Объект.НачалоПериода);
	КонецПериода = КонецДня(Объект.КонецПериода);
	ТабЧасть = Объект.ТабЧасть;
	Организация = Объект.Организация;

	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",Новый Граница(КонецПериода,ВидГраницы.Включая));
    Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.РасчетыСПокупателями); 
	
	Если ЮрФизЛицо = Перечисления.УдалитьЮрФизЛицо.ФизЛицо Тогда
		ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо; 
	Иначе
		ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо; 
	КОнецЕсли;	
	Запрос.УстановитьПараметр("ЮрЛицо",ЮридическоеФизическоеЛицо);
	
	Запрос.Текст = "ВЫБРАТЬ
	        |ХозрасчетныйОбороты.Счет КАК Счет,
			|ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
			|ХозрасчетныйОбороты.Субконто2 КАК Договор,
			|ХозрасчетныйОбороты.Субконто3 КАК ДокументРасчетов,
			|ХозрасчетныйОбороты.Субконто3.Дата КАК ДатаРасчетов,
			|ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаДолга,
			|ХозрасчетныйОбороты1.СуммаОборотДт КАК ВыручкаКонтрагента,
			|ХозрасчетныйОбороты1.СуммаОборотДт - ХозрасчетныйОбороты1.СуммаОборотКт КАК ДолгКонтрагента 
		    |ИЗ
			|РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , , , Субконто1.ЮридическоеФизическоеЛицо = &ЮрЛицо, , ) КАК ХозрасчетныйОбороты
		    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , , , Субконто1.ЮридическоеФизическоеЛицо = &ЮрЛицо, , ) КАК ХозрасчетныйОбороты1
		    |ПО  ХозрасчетныйОбороты.Субконто1 = ХозрасчетныйОбороты1.Субконто1				
		    |ГДЕ
			|ХозрасчетныйОбороты1.Организация = &Организация
			|И ХозрасчетныйОбороты.Организация = &Организация
			|И ХозрасчетныйОбороты1.Счет = &Счет
			|И ХозрасчетныйОбороты.Счет = &Счет
			|И ХозрасчетныйОбороты1.СуммаОборотДт > ХозрасчетныйОбороты1.СуммаОборотКт
			|И ХозрасчетныйОбороты.СуммаОборотДт > ХозрасчетныйОбороты.СуммаОборотКт
		    |УПОРЯДОЧИТЬ ПО
			|ХозрасчетныйОбороты.Субконто1.Наименование,
			|ДатаРасчетов";
			
    Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ЮрФизЛицо = Объект.ЮрФизЛицо;
	КонецПериода = КонецДня(Объект.КонецПериода);
	ТабЧасть = Объект.ТабЧасть;
	Организация = Объект.Организация;
	
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрана организация !");
		Сообщение.Сообщить();
	КонецЕсли;

	Если ЮрФизЛицо = Перечисления.УдалитьЮрФизЛицо.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрано Юр/физ. лицо!");
		Сообщение.Сообщить();
	КонецЕсли; 
	
	ТабЧасть.Очистить();
	ВыручкаВсего = ВыручкаЗаПериод(); 
	КолДней = День(КонецПериода);
	Выборка = ВыборкаЗадолженностиКонтрагентов();	
	Пока Выборка.Следующий() Цикл
		СрокЗадержки = РазностьДатВДнях(КонецПериода,Выборка.ДатаРасчетов);
		Если (СрокЗадержки >= КолДней) И (Выборка.СуммаДолга>=1000) Тогда  
			СтрТабЧасти = ТабЧасть.Добавить();
			СтрТабЧасти.СчетРасчетов         = Выборка.Счет;
			СтрТабЧасти.Контрагент           = Выборка.Контрагент;
			СтрТабЧасти.Договор              = Выборка.Договор;
			СтрТабЧасти.ДокументРасчетов     = Выборка.ДокументРасчетов;					
			СтрТабЧасти.СуммаДолга           = Выборка.СуммаДолга;
			СтрТабЧасти.СрокЗадержки         = СрокЗадержки;
			Если (СрокЗадержки <= 90)Тогда Коэфф = 0.1;
			ИначеЕсли (СрокЗадержки > 90)  И (СрокЗадержки <= 180) Тогда Коэфф = 0.2;
			ИначеЕсли (СрокЗадержки > 180) И (СрокЗадержки <= 270) Тогда Коэфф = 0.3;
			ИначеЕсли (СрокЗадержки > 270) Тогда Коэфф = 0.5;
			КонецЕсли;
			СтрТабЧасти.Коэффициент          = Коэфф;
			СтрТабЧасти.СуммаНачисления      = Коэфф*Выборка.СуммаДолга;					
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
         ОписаниеОповещения = Новый ОписаниеОповещения("РезультатВыбораПериода",ЭтотОбъект);
         ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода",,,,,,ОписаниеОповещения);

КонецПроцедуры                                                                    

&НаКлиенте                                                                         
Процедура РезультатВыбораПериода(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		Объект.НачалоПериода = НачалоДня(Результат.НачалоПериода);
		Объект.КонецПериода = КонецДня(Результат.КонецПериода); 
	КонецЕсли;

КонецПроцедуры
